---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
DockablePaneState Constructor
DockablePaneState Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | DockablePaneState()()()() | Creates a new DockablePaneState object. |
|  | DockablePaneState(DockablePaneState) | Constructs a new copy of the input DockablePaneState object. |

# See Also

DockablePaneState Class

DockablePaneState Members

Autodesk.Revit.UI Namespace